Update streamlit layout
